load-tests/artillery.yml
config:
  target: "http://localhost:8007"
  environments:
    python:          { target: "http://localhost:8007" }
    java:            { target: "http://localhost:8002" }
    go:              { target: "http://localhost:8003" }
    cpp:             { target: "http://localhost:8004" }
    nest:            { target: "http://localhost:8006" }
  # Goal: compare per-request speed across languages, not saturation behavior.
  # A constant low rate every implementation can sustain keeps queues empty, so
  # p50/p95 reflect real processing time rather than timeouts. Sample count comes
  # from duration, not rate. Raise arrivalRate only if no impl is timing out.
  phases:
    - name: Warm up
      duration: 15
      arrivalRate: 2
    - name: Measure
      duration: 120
      arrivalRate: 10
  timeout: 30
  defaults:
    headers:
      Content-Type: application/json
  payload:
    path: "./queries.csv"
    skipHeader: true
    fields:
      - nb_car
      - cars
      - strict
      - lst_hint
    order: random
  processor: "./payload-processor.js"

scenarios:
  - name: "Health check"
    weight: 1
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "search/file — randomized"
    weight: 12
    flow:
      - post:
          url: "/search/file"
          beforeRequest: buildSearchFile
          expect:
            - statusCode: 200

  - name: "search/many — randomized"
    weight: 24
    flow:
      - post:
          url: "/search/many"
          beforeRequest: buildSearchMany
          expect:
            - statusCode: 200