load-tests/artillery.yml
config:
  target: "http://localhost:8000"
  environments:
    python-base:     { target: "http://localhost:8000" }
    python-improved: { target: "http://localhost:8001" }
    python-indexed:  { target: "http://localhost:8005" }
    java:            { target: "http://localhost:8002" }
    go:              { target: "http://localhost:8003" }
    cpp:             { target: "http://localhost:8004" }
    nest:            { target: "http://localhost:8006" }
  phases:
    - name: Warm up
      duration: 10
      arrivalRate: 2
    - name: Ramp up
      duration: 30
      arrivalRate: 2
      rampTo: 20
    - name: Sustained
      duration: 60
      arrivalRate: 20
    - name: Ramp down
      duration: 30
      arrivalRate: 20
      rampTo: 2
  timeout: 30
  defaults:
    headers:
      Content-Type: application/json
  payload:
    path: "./queries.csv"
    fields:
      - nb_car
      - cars
      - strict
      - lst_hint
    order: random
  processor: "./payload-processor.js"

scenarios:
  - name: "Health check"
    weight: 1
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "search/file — randomized"
    weight: 12
    flow:
      - post:
          url: "/search/file"
          beforeRequest: buildSearchFile
          expect:
            - statusCode: 200

  - name: "search/many — randomized"
    weight: 24
    flow:
      - post:
          url: "/search/many"
          beforeRequest: buildSearchMany
          expect:
            - statusCode: 200